# กลุ่ม
GROUP_IDS = [
    "1396145167522075", # บางเขน
    # "2798542033610328", # บางเขน
    "417449789872854", # คอนโดให้เช่า ม.กรุงเทพ พลัมพาร์ค พลัมอไลฟ์
    "2334522046872720", # หาห้องพักย่านรังสิต 100,000+ คน
    "622298841721795", # หอพักให้เช่า​ คอนโดให้เช่า ใกล้ ม.รังสิต​ ม.กรุงเทพ​ ม.ธรรมศาสตร์
    "476633613627895", # คอนโดสำหรับนักศึกษา โซนรังสิต ทุกมหาลัย ม.กรุงเทพ ม.ธรรมศาสตร์ ม.รังสิต
    "1428966847950346", # 400 กว่าคน คอนโดใกล้ม.ธรรมศาสตร์ Modiz launch, D Condo, Kave town condo
    "1093378301215297", # หาห้องพักย่านรังสิต ใกล้ ม.กรุงเทพ ม.ธรรมศาสตร์ ม.รังสิต | ห้องพักให้เช่า
    "1678826688975625", # บ้านเช่ารังสิต มอกรุงเทพ คลองหลวง
    "141462283186326/buy_sell_discussion", # คอนโดแถวรังสิต ม.รังสิต ม.กรุงเทพ มธ. (ประกาศฟรี)
    "condouniversity", # หอพักให้เช่า คอนโดให้เช่า ย่านรังสิต
    "260556398963387", # หาเพื่อน หารูมเมท ม.กรุงเทพ ม.รังสิต ม.มธ
    "955904261626444", # kave ava, kave TU, modiz
]

POSTS_URL = [
    "https://www.facebook.com/MvPropertyRealEstate/posts/pfbid02PFRYiaf1xs3iumm5e5ahdLHTRzaLbaVCLnfZWUan3m5zec5vCjHFCFswfnkmigZal?__cft__[0]=AZVPnhidS8vRHNljTahB3UCErD-XxQFgjS2TluPkZ4g-vfW-kouWVNg9Qw0dUw2K1gIIxb8jLWuSEi_KkIPbogsXhwVo_lJE4Q9x7uy4fZv0YHEBBA2kG_Pok9teQtSB5Kd9G4DyVRpy-9igmWQ1-j9deihHavUwQsS31KnaLlxjfyYukf6FW0NqLQH9dL7TA8k&__tn__=%2CO%2CP-R"
]

CONTRACT = """
สนใจติดต่อ☎️ 082-779-3383 (เมฆ)
                       081-479-2776(ชัยชาญ)
                       หรือ inbox 📩
                  Line @MVproperty(มี@) ได้เลยครับ"""

MESSAGES = [

"""642.For rent KAVE  TU  
ตึก D ชั้น 2  28 ตร.ม. 
ทางขึ้นห้องสะดวก จอดรถขึ้นตึกได้เลย  
ห้องสะอาด ห้องมีเฟอร์นิเจอร์ พร้อมเข้าอยู่ 
ไมโครเวฟ ตู้เย็น แอร์ เครื่องซักผ้า ให้ครบ
ราคา 9,000 ต่อเดือน""",

"""644.Dcondo hype ม.กรุงเทพ
ชั้น 5 ตึกเอ ขนาด 24.5 ตรม
ตกแต่งเต็มที่ เครื่องใช้ไฟฟ้าครบ 
ราคา
1 ปี 12000 บาทต่อเดือน
2 ปี 11000 บาทต่อเดือน
""",

"""645.ปล่อยเช่าคอนโด คอมมอน ทียู มหาวิทยาลัยธรรมศาสตร์ รังสิต ขนาด 31 ตร.ม. 1 ห้องนอน 1 ห้องน้ำ ชั้น 22
เฟอร์ + เครื่องใช้ไฟฟ้าครบ 
แอร์ ทีวี ตู้เย็น ไมโครเวฟ เครื่องทำน้ำอุ่น เครื่องซักผ้า
สภาพแวดล้อมดี เดินทางไป มหาวิทยาลัยธรรมศาสตร์รังสิต สะดวกมากๆ""",

"""647.เช่า KaveTownSpace ตึกB ชั้น4 ราคา 14,000บาท 
✅โครงการหน้าสุดมีประตูทางเชื่อมเดินผ่านมิงเกิ้ลมอลล์ไปเรียนได้เลย
✅มีshuttle bus รับส่งจากหน้าโครงการถึงมิงเกิ้ลมอลล์
✅ตึกB(ตึกเดียวกับนิติหน้าสุดรับพัสดุ+อาหารที่สั่งที่เดียวเลย)ชั้น4วิวในวิวสวนต้นไม้อากาศสดชื่น
✅ขนาด28ตรม.ห้องนี้บิ้วท์อินเพิ่มพื้นที่เก็บของ เฟอร์นิเจอร์เครื่องใช้ไฟฟ้าครบ
🩵เตียงนอน 6 ฟุต
🩵ที่นอน+หมอน+ผ้าปู+ผ้านวม
🩵ตู้เย็น 2 ประตู
🩵เครื่องปรับอากาศ 18,000 BTU
🩵ผ้าม่านกรองแสงยูวี 2 ชั้น
🩵Smart TV 55 นิ้ว
🩵ชุดโซฟา BED ห้องนั่งเล่น 
🩵โต๊ะทำงาน บิ้วอินตู้เก็บของ
🩵ชุดห้องครัว Built In 
🩵เครื่องซักผ้า
🩵ซิ้งค์ล้างจาน
🩵ชั้นวางของ Built in
🩵เครื่องปรับอุณหภูมิในห้อง 
🩵ไมโครเวฟ
🩵เครื่องทำน้ำอุ่น
🩵ตู้อาบน้ำแบบแยก
🩵Bluetooth Sound System
🩵ประตูเข้าห้องแบบ Digital Door Lock""",

"""648.ปล่อยเช่า DcondoHype ตึกB ชั้น 8 
🤍เดือนละ 12000🤍
(รวมค่าส่วนกลางแล้ว)
🤍แรกเข้าเงินประกัน2เดือนล่วงหน้า1เดือน
เปิดจอง ดีคอนโดไฮป์ตรงข้ามม.กรุงเทพ ที่จอดรถมากถึง30%
-ขนาดห้อง 26.50 ตรม. วิว ม.กรุงเทพ
ห่างไกลเสียงรบกวนเงียบสงบเหมาะกับการอ่านหนังสือระเบียงทิศใต้ไม่ร้อน
-ผ้าม่าน2ชั้นกรองแสงได้ดี
-ห้องน้ำแยกโซนเปียกแห้ง
-สิ่งอำนวยความสะดวกเครื่องใช้ไฟฟ้าครบ
•ที่นอน5ฟุต+หมอน Dunlopillo
•ชุดผ้าปูและผ้านวมขนเป็ดนุ่มสบายสุดฟิน
•โต๊ะอ่านหนังสือพื้นที่ทำงานกว้างขวาง
•Samsung Smart TV 50 นิ้ว 
•เครื่องทำน้ำอุ่น Stiebel 3.5 วัตต์
•ตู้เย็น sumsung 7.4Q 2ประตู
•เครื่องซักผ้าToshiba ฝาหน้า 9.5 Kg
•ไมโครเวฟ Samsung 2.3 L
•Digital Door Lock พร้อมสแกนลายนิ้วมือปลอดภัยไร้กังวล
•อุปกรณ์ตรวจจับควันไฟ
•ลิฟท์ใช้งาน2ตัว
•อำนวยความสะดวกโดยพนักงานรักษาความปลอดภัยและกล้องวงจรปิดทั่วโครงการ""",

"""649.ให้เช่าคอนโด คอมมอน ทียู มหาวิทยาลัยธรรมศาสตร์ รังสิต 
ขนาด 31 ตร.ม. 1 ห้องนอน 1 ห้องน้ำ ชั้น 30
ห้องพร้อมอยู่
- ชั้น 30
- 31 ตรม
- ทิศใต้ ไม่ร้อน 
- 1 ห้องนอน, 1 ห้องน้ำ, ห้องนั่งเล่น+ครัว 
 - เครื่องใช้ไฟฟ้า(แอร์ 2 ตัว, ตู้เย็น, TV, ไมโครเวฟ, เครื่องทำน้ำอุ่น, เครื่องซักผ้า)
ราคา 15,500 ต่อเดือน
สภาพแวดล้อมดี เดินทางไป มหาวิทยาลัยธรรมศาสตร์รังสิต สะดวกมากๆ""",

"""650. For rent Dcondo hideaway รังสิต โครงการใหม่ล่าสุดจาก แสนสิริ 
ใครมีลูกมีหลายจะเรียน ม.ธรรมศาสตร์ ม.กรุงเทพ ม.รังสิต คอนโดนี้ที่สุดแล้ว คุ้มค่าและน่าอยู่ที่สุด
ตำแหน่งห้องดี วิวสวย เฟอร์ครบ เครื่องใช้ไฟฟ้าครบ พร้อมอยู่
ราคาเช่า9,000 บาทต่อเดือน สามารถนัดดูห้องจริงได้
พร้อมสิ่งอำนวยความสะดวกภายในโครงการครบครัน
- สระว่ายน้ํา
- ฟิตเนส
- โคเวิร์คกิ้งสเปซ (Co-Working Space)
- ลานจอดรถ ขนาดใหญ่
Security 24 hr.
- ระบบโทรทัศน์วงจรปิด
- ระบบผ่านเข้าออก โดยใช้คีย์การ์ด
- รปภ.""",

"""652.ให้เช่าคอนโด คอมมอน ทียู มหาวิทยาลัยธรรมศาสตร์ รังสิต ขนาด 31 ตร.ม. 1 ห้องนอน 1 ห้องน้ำ ชั้น 10
ห้องพร้อมอยู่
เฟอร์ + เครื่องใช้ไฟฟ้าครบ 
แอร์ ทีวี ตู้เย็น ไมโครเวฟ เครื่องทำน้ำอุ่น เครื่องซักผ้า
ราคา 16,500 ต่อเดือน
สภาพแวดล้อมดี เดินทางไป มหาวิทยาลัยธรรมศาสตร์รังสิต สะดวกมากๆ"""
]
