# กลุ่ม
GROUP_IDS = [
    "1396145167522075", # บางเขน
    # "2798542033610328", # บางเขน
    "417449789872854", # คอนโดให้เช่า ม.กรุงเทพ พลัมพาร์ค พลัมอไลฟ์
    "2334522046872720", # หาห้องพักย่านรังสิต 100,000+ คน
    "622298841721795", # หอพักให้เช่า​ คอนโดให้เช่า ใกล้ ม.รังสิต​ ม.กรุงเทพ​ ม.ธรรมศาสตร์
    "476633613627895", # คอนโดสำหรับนักศึกษา โซนรังสิต ทุกมหาลัย ม.กรุงเทพ ม.ธรรมศาสตร์ ม.รังสิต
    "1428966847950346", # 400 กว่าคน คอนโดใกล้ม.ธรรมศาสตร์ Modiz launch, D Condo, Kave town condo
    "1093378301215297", # หาห้องพักย่านรังสิต ใกล้ ม.กรุงเทพ ม.ธรรมศาสตร์ ม.รังสิต | ห้องพักให้เช่า
    "1678826688975625", # บ้านเช่ารังสิต มอกรุงเทพ คลองหลวง
    "141462283186326/buy_sell_discussion", # คอนโดแถวรังสิต ม.รังสิต ม.กรุงเทพ มธ. (ประกาศฟรี)
    "condouniversity", # หอพักให้เช่า คอนโดให้เช่า ย่านรังสิต
    "260556398963387", # หาเพื่อน หารูมเมท ม.กรุงเทพ ม.รังสิต ม.มธ
    "955904261626444", # kave ava, kave TU, modiz
]

CONTRACT = """
สนใจติดต่อ☎️ 082-779-3383 (เมฆ)
                       081-479-2776(ชัยชาญ)
                       หรือ inbox 📩
                  Line @MVproperty(มี@) ได้เลยครับ"""

MESSAGES = [

"""644.Dcondo hype ม.กรุงเทพ
ชั้น 5 ตึกเอ ขนาด 24.5 ตรม
ตกแต่งเต็มที่ เครื่องใช้ไฟฟ้าครบ 
ราคา
1 ปี 12000 บาทต่อเดือน
2 ปี 11000 บาทต่อเดือน
""",
]
